app/views/degree_search/advanced_search.html.haml

SELECT "institutions".* FROM "institutions"
---
        .col-md-5.left-align
          = select_tag :institute, options_for_select(@institutions.collect{|i| i.name}.uniq), include_blank: "Institution"
      .row
        .col-md-5

SELECT "courses".* FROM "courses"
---
        .col-md-5.left-align
          = select_tag :duration, options_for_select(@degrees.collect{|d| d.length}.uniq), include_blank: "Course Duration"