app/controllers/application_controller.rb

    def set_last_sign_in_at
      current_user.update_attribute(:last_sign_in_at, Time.current)
---
UPDATE "users" SET "last_sign_in_at" = $1, "updated_at" = $2 WHERE "users"."email" = $3  [["last_sign_in_at", "2019-04-30 11:02:26.665315"], ["updated_at", "2019-04-30 11:02:26.668252"], ["email", "dknott1@sheffield.ac.uk"]]