app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE (courses.name ILIKE 'A%') ORDER BY name ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
---
  def set_course
    @course = Course.find(params[:id])