app/controllers/members_controller.rb

  def set_member
    @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]