app/controllers/pages_controller.rb

  def advanced_search
    authorize! :read, :pages
    @current_nav_identifier = :advanced_search
    @degrees = Course.all
    @institutions = Institution.all
---
SELECT "courses".* FROM "courses"
SELECT "institutions".* FROM "institutions"