app/controllers/static_pages_controller.rb

SELECT  "static_pages".* FROM "static_pages" WHERE "static_pages"."name" = $1 LIMIT $2  [["name", "home"], ["LIMIT", 1]]
---
  def set_page
    @static_page = StaticPage.find_by name: params[:name]