app/controllers/stored_searches_controller.rb

  def new_search(params)
    search = StoredSearch.new
    search.email = params[:email]
    search.name = params[:subject] #This is super annoying. Subject is a much better name
    search.institution = params[:institution]
    search.length = params[:duration]
    search.delivery_mode = nil
    search.full_time = params[:full_time]
    search.distance = params[:distance]
    search.location = params[:location]

    if search.save!
---
INSERT INTO "stored_searches" ("email", "name", "institution", "length", "full_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"