app/controllers/users/passwords_controller.rb

  def create
    email = resource_params[:email]
    user = User.where(email: email).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."email" ASC LIMIT $2  [["email", "dknott1@sheffield.ac.uk"], ["LIMIT", 1]]

  def update
    token = params[:user][:reset_password_token]
    user = User.where(reset_password_token: token).first
    if user.nil?
      redirect_to edit_user_password_url(reset_password_token: token), notice: 'Invalid Reset Token'
    else
      if params[:user][:password] == params[:user][:password_confirmation]
        user.update(password: params[:user][:password],
                    password_confirmation: params[:user][:password_confirmation])
        user.save!
---
UPDATE "users" SET "encrypted_password" = $1, "reset_password_token" = $2, "reset_password_sent_at" = $3, "updated_at" = $4 WHERE "users"."email" = $5
UPDATE "users" SET "reset_password_token" = $1, "reset_password_sent_at" = $2, "updated_at" = $3 WHERE "users"."email" = $4