app/controllers/users/registrations_controller.rb

  def new
    @privacies = Privacy.all
---
SELECT "privacies".* FROM "privacies"

  def create
    member_attr = sign_up_params[:member_attributes]
    if validate_email(sign_up_params[:email])
      member_attr[:institution_id] = get_institute(sign_up_params[:email])
      member_attr[:role_id] = Role.find_by(name: 'Pending').id
---
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "Pending"], ["LIMIT", 1]]

  def create_transaction(member, user)
    if !User.exists?(email: sign_up_params[:email])
      User.transaction do
        member.save!
        user[:member_id] = member[:id]
        if user.valid? && user.save!
---
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "dknott1@sheffield.ac.uk"], ["LIMIT", 1]]
INSERT INTO "members" ("title", "name", "job", "bio", "institution_id", "role_id", "account_privacy_id", "created_at", "updated_at", "email_privacy_id", "bio_privacy_id", "job_privacy_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
INSERT INTO "users" ("email", "encrypted_password", "member_id", "last_sign_in_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "email"

  def validate_email(email)
    domain = email.split('@').last
    return unless sign_up_params[:email].end_with?('.ac.uk')
    return unless Institution.exists?(['email ILIKE ?', "%#{domain}%"])
---
SELECT  1 AS one FROM "institutions" WHERE (email ILIKE '%sheffield.ac.uk%') LIMIT $1  [["LIMIT", 1]]
SELECT "institutions"."id" FROM "institutions" WHERE (email ILIKE '%sheffield.ac.uk%')